ningdaoxiao/stm32F030_RTX5/Device/drv_keys.c
// -*- coding: utf-8 -*-
/**
 * @file    drv_led.c
 * @author  Thonelyne
 * @brief   Implementation of the example module
 * @version 1.0.0
 * @date    2025-11-22
 *
 * @copyright
 * Copyright (c) 2025 Your Company. All rights reserved.
 */

/* -------------------------------------------------------------------------- */
/*                                  Includes                                  */
/* -------------------------------------------------------------------------- */
#include "drv_keys.h"
#include "stm32f0xx.h"                  // Device header
#include "main.h"
//#include <stdio.h>

/* -------------------------------------------------------------------------- */
/*                             Private Definitions                             */
/* -------------------------------------------------------------------------- */
//#define EXAMPLE_INTERNAL_CONST   (42)
#define KEY_PRESSED				1
#define KEY_UNPRESSED			0

#define KEY_TIME_DOUBLE			200
#define KEY_TIME_LONG			2000
#define KEY_TIME_REPEAT			100

/* -------------------------------------------------------------------------- */
/*                             Private Global Vars                             */
/* -------------------------------------------------------------------------- */

uint8_t Key_Flag[KEY_COUNT];
/* -------------------------------------------------------------------------- */
/*                          Private Function Prototypes                        */
/* -------------------------------------------------------------------------- */
//static void example_internal_helper(void);

/* -------------------------------------------------------------------------- */
/*                           Public Function Definitions                       */
/* -------------------------------------------------------------------------- */
/**
  * 函    数：按键初始化，已在GPIO中初始化
  * 参    数：无
  * 返 回 值：无
  */
//void Key_Init(void)
//{
//	/*开启时钟*/
////    __HAL_RCC_GPIOF_CLK_ENABLE();
//    __HAL_RCC_GPIOA_CLK_ENABLE();
//    __HAL_RCC_GPIOB_CLK_ENABLE();
//	
//	/*GPIO初始化*/
//	GPIO_InitTypeDef GPIO_InitStruct;
//    
//    /*Configure GPIO pins : MCU_KEY_IN1_Pin MCU_KEY_IN2_Pin MCU_KEY_IN3_Pin */
//    GPIO_InitStruct.Pin = MCU_KEY_IN1_Pin|MCU_KEY_IN2_Pin|MCU_KEY_IN3_Pin;
//    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
//    GPIO_InitStruct.Pull = GPIO_NOPULL;
//    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

//    /*Configure GPIO pin : MCU_PWR_KEY_Pin */
//    GPIO_InitStruct.Pin = MCU_PWR_KEY_Pin;
//    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
//    GPIO_InitStruct.Pull = GPIO_NOPULL;
//    HAL_GPIO_Init(MCU_PWR_KEY_GPIO_Port, &GPIO_InitStruct);
//    
//}
/* -------------------------------------------------------------------------- */
/*                           Private Function Definitions                       */
/* -------------------------------------------------------------------------- */
uint8_t Key_GetState(uint8_t n)
{
	if (n == KEY_1)
	{
		if (HAL_GPIO_ReadPin(MCU_KEY_IN1_GPIO_Port, MCU_KEY_IN1_Pin) == GPIO_PIN_RESET)
		{
			return KEY_PRESSED;
		}
	}
	else if (n == KEY_2)
	{
		if (HAL_GPIO_ReadPin(MCU_KEY_IN2_GPIO_Port, MCU_KEY_IN2_Pin) == GPIO_PIN_RESET)
		{
			return KEY_PRESSED;
		}
	}
	else if (n == KEY_3)
	{
		if (HAL_GPIO_ReadPin(MCU_KEY_IN3_GPIO_Port, MCU_KEY_IN3_Pin) == GPIO_PIN_RESET)
		{
			return KEY_PRESSED;
		}
	}
	else if (n == KEY_PWR)
	{
		if (HAL_GPIO_ReadPin(MCU_PWR_KEY_GPIO_Port, MCU_PWR_KEY_Pin) == GPIO_PIN_RESET)
		{
			return KEY_PRESSED;
		}
	}
	return KEY_UNPRESSED;
}

uint8_t Key_Check(uint8_t n, uint8_t Flag)
{
	if (Key_Flag[n] & Flag)
	{
		if (Flag != KEY_HOLD)
		{
			Key_Flag[n] &= ~Flag;
		}
		return 1;
	}
	return 0;
}

void Key_Tick(void)
{
	static uint8_t Count, i;
	static uint8_t CurrState[KEY_COUNT], PrevState[KEY_COUNT];
	static uint8_t S[KEY_COUNT];
	static uint16_t Time[KEY_COUNT];
	
	for (i = 0; i < KEY_COUNT; i ++)
	{
		if (Time[i] > 0)
		{
			Time[i] --;
		}
	}
	
	Count ++;
	if (Count >= 20)
	{
		Count = 0;
		
		for (i = 0; i < KEY_COUNT; i ++)
		{
			PrevState[i] = CurrState[i];
			CurrState[i] = Key_GetState(i);
			
			if (CurrState[i] == KEY_PRESSED)
			{
				Key_Flag[i] |= KEY_HOLD;
			}
			else
			{
				Key_Flag[i] &= ~KEY_HOLD;
			}
				
			if (CurrState[i] == KEY_PRESSED && PrevState[i] == KEY_UNPRESSED)
			{
				Key_Flag[i] |= KEY_DOWN;
			}
			
			if (CurrState[i] == KEY_UNPRESSED && PrevState[i] == KEY_PRESSED)
			{
				Key_Flag[i] |= KEY_UP;
			}
			
			if (S[i] == 0)
			{
				if (CurrState[i] == KEY_PRESSED)
				{
					Time[i] = KEY_TIME_LONG;
					S[i] = 1;
				}
			}
			else if (S[i] == 1)
			{
				if (CurrState[i] == KEY_UNPRESSED)
				{
					Time[i] = KEY_TIME_DOUBLE;
					S[i] = 2;
				}
				else if (Time[i] == 0)
				{
					Time[i] = KEY_TIME_REPEAT;
					Key_Flag[i] |= KEY_LONG;
					S[i] = 4;
				}
			}
			else if (S[i] == 2)
			{
				if (CurrState[i] == KEY_PRESSED)
				{
					Key_Flag[i] |= KEY_DOUBLE;
					S[i] = 3;
				}
				else if (Time[i] == 0)
				{
					Key_Flag[i] |= KEY_SINGLE;
					S[i] = 0;
				}
			}
			else if (S[i] == 3)
			{
				if (CurrState[i] == KEY_UNPRESSED)
				{
					S[i] = 0;
				}
			}
			else if (S[i] == 4)
			{
				if (CurrState[i] == KEY_UNPRESSED)
				{
					S[i] = 0;
				}
				else if (Time[i] == 0)
				{
					Time[i] = KEY_TIME_REPEAT;
					Key_Flag[i] |= KEY_REPEAT;
					S[i] = 4;
				}
			}
		}
	}
}
